CSI API ETABS v1
cAreaObj.AddByCoord Method
 Adds a new area object, defining points at the specified coordinates.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddByCoord(
	int NumberPoints,
	ref double[] X,
	ref double[] Y,
	ref double[] Z,
	ref string Name,
	string PropName = "Default",
	string UserName = "",
	string CSys = "Global"
)
Function AddByCoord (
	NumberPoints As Integer,
	ByRef X As Double(),
	ByRef Y As Double(),
	ByRef Z As Double(),
	ByRef Name As String,
	Optional PropName As String = "Default",
	Optional UserName As String = "",
	Optional CSys As String = "Global"
) As Integer
Dim instance As cAreaObj
Dim NumberPoints As Integer
Dim X As Double()
Dim Y As Double()
Dim Z As Double()
Dim Name As String
Dim PropName As String
Dim UserName As String
Dim CSys As String
Dim returnValue As Integer
returnValue = instance.AddByCoord(NumberPoints,
	X, Y, Z, Name, PropName, UserName, CSys)
int AddByCoord(
	int NumberPoints,
	array<double>^% X,
	array<double>^% Y,
	array<double>^% Z,
	String^% Name,
	String^ PropName = L"Default",
	String^ UserName = L"",
	String^ CSys = L"Global"
)
abstract AddByCoord :
        NumberPoints : int *
        X : float[] byref *
        Y : float[] byref *
        Z : float[] byref *
        Name : string byref *
        ?PropName : string *
        ?UserName : string *
        ?CSys : string
(* Defaults:
        let _PropName = defaultArg PropName "Default"
        let _UserName = defaultArg UserName ""
        let _CSys = defaultArg CSys "Global"
*)
-> int
Parameters
NumberPoints
Type: System.Int32
 The number of points in the area object.
X
Type: System.Double[]
 This is the array of x coordinates for the corner points of the area object. The coordinates are in the coordinate system defined by the CSys item. The coordinates should be ordered to run clockwise or counter clockwise around the area object.
Y
Type: System.Double[]
 This is the array of y coordinates for the corner points of the area object. The coordinates are in the coordinate system defined by the CSys item. The coordinates should be ordered to run clockwise or counter clockwise around the area object.
Z
Type: System.Double[]
 This is the array of z coordinates for the corner points of the area object. The coordinates are in the coordinate system defined by the CSys item. The coordinates should be ordered to run clockwise or counter clockwise around the area object.
Name
Type: System.String
 This is the name that the program ultimately assigns to the area object. If no userName is specified, the program assigns a default name to the area object. If a userName is specified and that name is not used for another area object, the userName is assigned to the area object; otherwise a default name is assigned to the area object.
PropName (Optional)
Type: System.String
 This is Default, None or the name of a defined area property.
 If it is Default, the program assigns a default area property to the area object. If it is None, no area property is assigned to the area object. If it is the name of a defined area property, that property is assigned to the area object.
UserName (Optional)
Type: System.String
CSys (Optional)
Type: System.String
 The name of the coordinate system in which the area object point coordinates are defined.
Return Value
Type: Int32
 Returns zero if the area object is successfully added, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim x() As Double
   Dim y() As Double
   Dim z() As Double
   Dim Name As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create blank template model
   ret = SapModel.File.NewBlank()
'add area object by coordinates
   ReDim x(5)
   ReDim y(5)
   ReDim z(5)
   x(0) = 50:   y(0) = 0
   x(1) = 100:  y(1) = 0
   x(2) = 150:  y(2) = 40
   x(3) = 100:  y(3) = 80
   x(4) = 50:   y(4) = 80
   x(5) = 0:    y(5) = 40
   ret = SapModel.AreaObj.AddByCoord(6, x, y, z, Name)
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace